Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
  static char cBuffer[BUFFER_SIZE];

  (void) pvParameters;

  char ch;
  do {
    printf("\n+- Menu ----------------------------------------------------+\n");
#ifdef CONFIG_APPS_HELLO_WORLD
    printf("| [1] - Run Hello World (Ported from OP-TEE, pseudo TA)     |\n");
#endif
#ifdef CONFIG_APPS_AES
    printf("| [2] - Run AES (Ported from OP-TEE, user TA)               |\n");
#endif
#ifdef CONFIG_APPS_HOTP
    printf("| [3] - Run HOTP (Ported from OP-TEE, user TA)              |\n");
#endif
    printf("| [4] - Get FreeRTOS Task List                              |\n");
#ifdef CONFIG_APPS_TEST
    printf("| [5] - Run Test Suite for GP TEE Client & Internal API     |\n");
#endif
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
    printf("| [6] - Run H/W Security exception example (from non-secure)|\n");
    printf("| [7] - Run H/W Security exception example (from secure)    |\n");
#endif
    printf("+-----------------------------------------------------------+\n");

    printf("\n[%c]\n", ch = getchar());

    switch (ch) {
#ifdef CONFIG_APPS_HELLO_WORLD
      case '1':
        xTaskCreate(teeHelloWorldTask,  /* The function that implements the task. */
        "tHelloWorld",           /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                  /* The size of the stack to allocate to the task. */
        (void *) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2, /* The priority assigned to the task. */
        NULL);
        break;
#endif
#ifdef CONFIG_APPS_AES
      case '2':
        xTaskCreate(teeAESTask, /* The function that implements the task. */
        "tAES",          /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                  /* The size of the stack to allocate to the task. */
        (void *) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2, /* The priority assigned to the task. */
        NULL);
        break;
#endif
#ifdef CONFIG_APPS_HOTP
      case '3':
        xTaskCreate(teeHotpTask, /* The function that implements the task. */
        "tHOTP",          /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                  /* The size of the stack to allocate to the task. */
        (void *) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2, /* The priority assigned to the task. */
        NULL);
        break;
#endif
      case '4':
        /* Obtain the current tick count. */
        printf("\nAuto-reload timer callback executing = %d\n", xTaskGetTickCount());

        /* Pass the buffer into vTaskList() to generate the table of information. */
        vTaskList(cBuffer);
        portDISABLE_INTERRUPTS();
        printf("%s\n", cBuffer);
        portENABLE_INTERRUPTS();
        break;
#ifdef CONFIG_APPS_TEST
        case '5':
        xTaskCreate( teeTestSuiteTask,  /* The function that implements the task. */
            "tTestSuite",               /* The text name assigned to the task - for debug only as it is not used by the kernel. */
            256,                        /* The size of the stack to allocate to the task. */
            ( void * ) NULL,            /* The parameter passed to the task - just to check the functionality. */
            tskIDLE_PRIORITY + 2,       /* The priority assigned to the task. */
            NULL );
        break;
#endif
#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
      case '6':
        menu_security_exception_example_ns();
        break;
      case '7':
        portDISABLE_INTERRUPTS();
        Secure_func();
        portENABLE_INTERRUPTS();
        break;
#endif
      default:
        break;
    }
    taskYIELD();
  } while (1);
}

/**
 * @brief         testTask1 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeLedBlinkTask( void *pvParameters )
{
  const TickType_t xDelay = 500 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    Secure_LED_On(6u);
    portENABLE_INTERRUPTS();
    vTaskDelay( xDelay );
    portDISABLE_INTERRUPTS();
    Secure_LED_Off(6u);
    portENABLE_INTERRUPTS();
    vTaskDelay( xDelay );
  } while (1);
}

/**
 * @brief         testTask2 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void testTask2( void *pvParameters )
{
  const TickType_t xDelay = 500 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf(YELLOW "Thread 2 test\n" NORMAL);
    portENABLE_INTERRUPTS();
    LED_On(7u);
    vTaskDelay( xDelay );
    LED_Off(7u);
    vTaskDelay( xDelay );
  } while (1);
}

/**
 * @brief         clnSrvTask - cleaning service.
 *
 * @param         None
 *
 * @returns       None
 */
static void clnSrvTask( void *pvParameters )
{
  const TickType_t xDelay = 1000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    vTaskPrioritySet( xTaskGetIdleTaskHandle(), uxTaskPriorityGet(xTaskGetCurrentTaskHandle()));
//    taskYIELD();
    vTaskDelay( xDelay );
    vTaskPrioritySet( xTaskGetIdleTaskHandle(), tskIDLE_PRIORITY);
    vTaskDelay( xDelay );
  } while (1);
}

#ifdef CONFIG_APPS_HELLO_WORLD
/**
 * @brief         teeHelloWorldTask - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeHelloWorldTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("TEE test: Hello_world\n");
    tee_hello_world();
    portENABLE_INTERRUPTS();
//    vTaskDelay( xDelay );
    vTaskDelete(NULL);
  } while (1);
}
#endif

#ifdef CONFIG_APPS_AES
/**
 * @brief         teeTest - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeAESTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

