Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("TEE test: AES\n");
    tee_aes();
    portENABLE_INTERRUPTS();
    vTaskDelete(NULL);
//    vTaskDelay( xDelay );
  } while (1);
}
#endif

#ifdef CONFIG_APPS_HOTP
/**
 * @brief         teeTest4 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeHotpTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("TEE test: HOTP\n");
    tee_hotp();
    portENABLE_INTERRUPTS();
    vTaskDelete(NULL);
//    vTaskDelay( xDelay );
  } while (1);
}
#endif // CONFIG_APPS_HOTP

#ifdef CONFIG_APPS_TEST
/**
 * @brief         teeTest4 - .
 *
 * @param         None
 *
 * @returns       None
 */
static void teeTestSuiteTask( void *pvParameters )
{
//  const TickType_t xDelay = 2000 / portTICK_PERIOD_MS;

  (void)pvParameters;

  do {
    portDISABLE_INTERRUPTS();
    printf("\nTEE test: test suite\n");
    tee_tests();
    portENABLE_INTERRUPTS();
    vTaskDelete(NULL);
//    vTaskDelay( xDelay );
  } while (1);
}
#endif // CONFIG_APPS_TEST

/* Public Functions. */
/**
 * @brief         vApplicationMallocFailedHook - vApplicationMallocFailedHook()
 *                will only be called if configUSE_MALLOC_FAILED_HOOK is set to
 *                1 in FreeRTOSConfig.h.  It is a hook function that will get
 *                called if a call to pvPortMalloc() fails. pvPortMalloc() is
 *                called internally by the kernel whenever a task, queue, timer
 *                or semaphore is created.  It is also called by various parts
 *                of the demo application.  If heap_1.c or heap_2.c are used,
 *                then the size of the heap available to pvPortMalloc() is
 *                defined by configTOTAL_HEAP_SIZE in FreeRTOSConfig.h, and the
 *                xPortGetFreeHeapSize() API function can be used to query the
 *                size of free heap space that remains (although it does not
 *                provide information on how the remaining heap might be
 *                fragmented).
 *
 * @param         None
 *
 * @returns       None
 */
void vApplicationMallocFailedHook( void )
{
  taskDISABLE_INTERRUPTS();
  for( ;; );
}

/**
 * @brief         vApplicationIdleHook - vApplicationIdleHook() will only be
 *                called if configUSE_IDLE_HOOK is set to 1 in FreeRTOSConfig.h.
 *                It will be called on each iteration of the idle task.  It is
 *                essential that code added to this hook function never attempts
 *                to block in any way (for example, call xQueueReceive() with a
 *                block time specified, or call vTaskDelay()).  If the
 *                application makes use of the vTaskDelete() API function (as
 *                this demo application does) then it is also important that
 *                vApplicationIdleHook() is permitted to return to its calling
 *                function, because it is the responsibility of the idle task
 *                to clean up memory allocated by the kernel to any task that
 *                has since been deleted.
 *
 * @param         None
 *
 * @returns       None
 */
void vApplicationIdleHook( void )
{
  ;
}

/**
 * @brief         vApplicationStackOverflowHook - .
 *
 * @param         None
 *
 * @returns       None
 */
void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
  ( void ) pcTaskName;
  ( void ) pxTask;

  /* Run time stack overflow checking is performed if
  configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
  function is called if a stack overflow is detected. */
  taskDISABLE_INTERRUPTS();

  //__BKPT();

    printf("Stack overflow task name=%s\n", pcTaskName);

  for( ;; );
}

/**
 * @brief         vApplicationTickHook - This function will be called by each
 *                tick interrupt if configUSE_TICK_HOOK is set to 1 in
 *                FreeRTOSConfig.h.  User code can be added here, but the tick
 *                hook is called from an interrupt context, so code must not
 *                attempt to block, and only the interrupt safe FreeRTOS API
 *                functions can be used (those that end in FromISR()).
 *
 * @param         None
 *
 * @returns       None (function is not supposed to return)
 */
void vApplicationTickHook( void )
{
  ;
}

#ifdef CONFIG_APPS_HW_SECURITY_EXCEPTION_EXAMPLE
void menu_security_exception_example_ns(void)
{
  char ch;
  int temp = 1;

  printf("+---------------------------------------------------------------------+\n");
  printf("| Type  | Range addresses         | Size      | Remarks               |\n");
  printf("+---------------------------------------------------------------------+\n");
  printf("| FLASH | 0x10040000 - 0x0007FFFF | 0x40000   | 256k                  |\n");
  printf("| RAM   | 0x30008000 - 0x30017FFF | 0x10000   | 64k                   |\n");
  printf("| GPIO  | PC                      |           | Port C is non-secure  |\n");
  printf("| GPIO  | PA,PB                   |           | Port A,B are secure   |\n");
  printf("+---------------------------------------------------------------------+\n\n");

  printf("+---------------------------------------------------------------------+\n");
  printf("| Key | Action                                   | Expected response  |\n");
  printf("+---------------------------------------------------------------------+\n");
  printf("| [1] | Read SRAM secure address 0x30000000      | Hard fault         |\n");
  printf("| [2] | Read SRAM secure address 0x20000000      | Hard fault         |\n");
  printf("| [3] | Read SRAM non-secure address 0x%08X  | Access successful  |\n",&temp);
  printf("|     | Read SRAM non-secure address 0x%08X  | Hard fault         |\n",(~0x10000000 & (unsigned int)&temp));
  printf("| [4] | Read FLASH secure address 0x00000000     | Hard fault         |\n");
  printf("| [5] | Read FLASH secure address 0x10000000     | Hard fault         |\n");
  printf("| [6] | Read FLASH non-secure address 0x10040000 | Access successful  |\n");
  printf("|     | Read FLASH non-secure address 0x00040000 | Hard fault         |\n");
  printf("| [7] | Read GPIO non-secure port PC1_NS         | Access successful  |\n");
  printf("|     | Write 0 GPIO non-secure port by PC1_NS   | Access successful  |\n");
  printf("|     | Write 1 GPIO non-secure port by PC1      | Hard fault         |\n");
  printf("| [8] | Read GPIO secure port PA10_NS            | RAZWI, sec. violat.|\n");
  printf("|     | Write 0 GPIO secure port by PA10_NS      | RAZWI, sec. violat.|\n");
  printf("|     | Write 1 GPIO secure port by PA10         | Hard fault         |\n");
  printf("| [9] | Write 0 to address 0x0 (directly)        | Hard fault         |\n");
  printf("| [a] | Read 0x30018000 address (nonexistent)    | Hard fault         |\n");
  printf("+---------------------------------------------------------------------+\n");

  printf("\n[%c] ", ch = getchar());

