Samsung/mTower/arch/cortex-m23/m2351/src/numaker_pfm_m2351/nonsecure/main_ns.c
  switch (ch) {
    case '1':
      printf("Read SRAM secure address 0x30000000: Hard fault occurs in secure\n");
      M32(0x30000000);
      break;
    case '2':
      printf("Read SRAM secure address 0x20000000: Hard fault occurs in secure\n");
      M32(0x20000000);
      break;
    case '3':
      printf("Read SRAM non-secure address 0x%08X = %08x\n", &temp, M32(&temp));
      printf("    Read SRAM non-secure address 0x%08X: Hard fault occurs in secure\n", (~0x10000000 & (unsigned int)&temp));
      M32((~0x10000000 & (unsigned int)&temp));
      break;
    case '4':
      printf("Read FLASH secure address 0x00000000: Hard fault occurs in secure\n");
      M32(0x00000000);
      break;
    case '5':
      printf("Read FLASH secure address 0x10000000: Hard fault occurs in secure\n");
      M32(0x10000000);
      break;
    case '6':
      printf("Read FLASH non-secure address 0x10040000 = %08x\n", M32(0x10040000));
      printf("    Read FLASH non-secure address 0x00040000: Hard fault occurs in secure\n");
      M32(0x00040000);
      break;
    case '7':
      printf("Read GPIO non-secure port PC1_NS = %d\n", PC1_NS);
      printf("    Write 0 GPIO non-secure port by PC1_NS.");
      PC1_NS = 0;
      printf(" Result: PC1_NS = %d\n", PC1_NS);
      printf("    Write 1 GPIO non-secure port by PC1. Hard fault occurs in secure\n");
      PC1 = 1;
      break;
    case '8':
      printf("Read GPIO secure port PA10_NS = %d. Result: GPIO violation interrupt occurs\n", PA10_NS);
      printf("    Write 1 GPIO secure port by PA10_NS. Result: GPIO violation interrupt occurs\n");
      PA10_NS = 1;
      printf("    Write 1 GPIO secure port by PA10. Hard fault occurs in secure\n");
      PA10 = 1;
      break;
    case '9':
      M32(0x10000000) = 0;
      break;
    case 'a':
      M32(0x30018000);
      break;
    default:
      break;
  }
while(1);
}
#endif
/**
 * @brief         main - entry point of mTower: nFreeRTOS.
 *
 * @param         None
 *
 * @returns       None (function is not supposed to return)
 */
int main( void )
{
  /* Prepare the hardware to run this demo. */
  prvSetupHardware();

  printf("\n\n\t-=mTower v" VERSION "=-  " __DATE__ "  " __TIME__"\n\n");

  printf("+---------------------------------------------+\n");
  printf("|     Nonsecure FreeRTOS is running ...       |\n");
  printf("+---------------------------------------------+\n");

  /* Init PC for Nonsecure LED control */
  GPIO_SetMode(PC_NS, BIT1 | BIT0, GPIO_MODE_OUTPUT);

//  Secure_func();

  /* register NonSecure callbacks in Secure application */
  Secure_LED_On_callback(&NonSecure_LED_On);
  Secure_LED_Off_callback(&NonSecure_LED_Off);

  xTaskCreate( menuTask,     /* The function that implements the task. */
        "menu",                /* The text name assigned to the task - for debug only as it is not used by the kernel. */
        256,                    /* The size of the stack to allocate to the task. */
        ( void * ) NULL,        /* The parameter passed to the task - just to check the functionality. */
        tskIDLE_PRIORITY + 2,   /* The priority assigned to the task. */
        NULL );

  xTaskCreate( teeLedBlinkTask,     /* The function that implements the task. */
      "tLedBlink",                /* The text name assigned to the task - for debug only as it is not used by the kernel. */
      256,                    /* The size of the stack to allocate to the task. */
      ( void * ) NULL,        /* The parameter passed to the task - just to check the functionality. */
      tskIDLE_PRIORITY + 2,   /* The priority assigned to the task. */
      NULL );

//  xTaskCreate( testTask2,     /* The function that implements the task. */
//      "test2",                /* The text name assigned to the task - for debug only as it is not used by the kernel. */
//      256,                    /* The size of the stack to allocate to the task. */
//      ( void * ) NULL,        /* The parameter passed to the task - just to check the functionality. */
//      tskIDLE_PRIORITY + 2,   /* The priority assigned to the task. */
//      NULL );
//
  xTaskCreate( clnSrvTask,    /* The function that implements the task. */
      "clnSrv",               /* The text name assigned to the task - for debug only as it is not used by the kernel. */
      256,                     /* The size of the stack to allocate to the task. */
      ( void * ) NULL,         /* The parameter passed to the task - just to check the functionality. */
      tskIDLE_PRIORITY + 2,    /* The priority assigned to the task. */
      NULL );

  vTaskStartScheduler();

  /* If all is well, the scheduler will now be running, and the following
  line will never be reached.  If the following line does execute, then
  there was insufficient FreeRTOS heap memory available for the idle and/or
  timer tasks to be created.  See the memory management section on the
  FreeRTOS web site for more details. */
  for( ;; );

  return 0;
}

